#+TITLE: Autoload based emacs configuration
This is another github hosted personal emacs configuration. Major
specifics:
- Only core functionality is in init.el
- Manually added [[id:8e8bcc52-801e-4bda-bdea-7f5c25fd123d][customization]] code inside =custom-set-variables= is used
  extensively.
- Additional functions/features in separate files that are autoloaded
- =bind-key= is used to bind user keybindings and track them

* Testing
To check at least minimum sanity after xonfiguration changes, run
=tz-start-emacs-tests= to start new emacs and make few tests with
"screenshots" in html. The screenshots are stored in the tests
directory managed by git to be able to detect and view changes (otoh,
changes to agenda content are not so relevant to be gited).

* Customization tricks
  :PROPERTIES:
  :ID:       8e8bcc52-801e-4bda-bdea-7f5c25fd123d
  :END:
Several possibly non-obvious tricks are used for customization:
- There is an [[file:autoloaded.d/customize-fixes.el][around advice]] on =custom-save-all= so that the custom.el
  file is saved more readably (at least for me).
- The customization saves the /expression/ of the customization as well,
  so you do not loose it when saving
- You can refer to the /standard value/ of the variable in the
  customization (even though it is not nice and uses =eval=), so that it
  is clear what is the customization there.
- The current custom setup can be merged with the defaults in default-custom.el by

The obvious trick - partially enabled by the sane saving - is to use
git to maintain /custom.el/. This is another git than this one (it
contains private information such as direcotry and server names, but
it still does not contain credentials)
* Snippets
The files in [[./autoloaded.d/][autoload]] and [[./lisp/experimental.d/][experimental]] started as a small snippets,
and there is a snippet to print some information about the snippets
file (callable by =f12 S=). Maybe it still makes sense to show what is there.

The third column shows whether the snippet has a bind key (=K=) and
where it resides (L for Local - no shown below, A for autoload, E for experimental
directory). Other column show first function defined in snippet and
first docstring.

#+begin_src emacs-lisp :exports both
(let ((tz-snippet-dirs (cdr tz-snippet-dirs))) ; dont print local snippets
  (tz-list-experimental-snippets))
(buffer-string)
#+end_src

#+RESULTS:
#+begin_example
nm-tz                nm-mode                        E    Network Manager mode
att-list             tz-insert-list-of-attachments  KA   Insert list of attachments of an org node
bbdb-swap            bbdb-swap-names                KA   Swap first and second name
download-to-place    tz-download-at-point           KA   Download linked element to the attachments.
eww                  tz-eww-toggle-images           KA   Toggle whether images are loaded and reload the current page from cache.
issues               issues-table                   A    Write issues block table.
jump-to-projects     tz-org-jump-top-projects       KA   Jump to a table with list of projects and their parameters.
kali                 kali-rw                        A    Run systemd container with Kali in a buffer.
list-snippets        tz-list-experimental-snippets  KA   List overview of experimental snippets to a buffer
org-abbrevs          logical-names-as-org-abbrevs   A    List of mapping from short name to a path.
org-capture-config   tz-capture-entry               A    Helper to be used in custom.el for org capture templates.
org-helpers          org-attach-dir-or-ask          A    Simplify creating attach directories with nicer names.
org-link-minor-mode  org-link-minor-mode-unfonti... A    Remove fontification and activation overlays from links.
org-slide-mode       org-tz-present                 KA   Present org mode as slides.
org-tracked-rename   org-tracked-rename             KA   Rename a header and make a note about it.
run-listed-program   tz-run-program                 KA   Run a program picked from a list based on `opt-programs' and `wine-programs'.
sanitize             tz-sanitize-for-kb             KA   Sanitize an org entry and move it to knowledgebase.org.
shodan               shodan-mode                    A    Shodan mode
sly-stumpwm          tz-run-stumpwm                 A    Start stumpwm window manager.
sqlite3              sqlite                         A    Execute SQL select and return column names and result data.
test-master          tz-start-emacs-tests           A    Run new emacs and start `after-init-tests' there.
test                 after-init-test                A    Run tests of emacs configuration to make sure it at least starts up.
#+end_example

* Open points
- Naming convention for functions and variables
- ponder future of logical names experiment
- ponder future of prodigy experiment

* Org organization thougths
- Manually maintained org-agenda-files in custom vs. agenda file vs. =C-c [=
